IDEA Open Model
HingeElement1D.HingeTypeX Property
Compatible with IDEA StatiCa Beta 20.0
 Hinge type in dirrection X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public HingeTypeInDirrection HingeTypeX { get; set; }
Public Property HingeTypeX As HingeTypeInDirrection
	Get
	Set
Property Value
Type: HingeTypeInDirrection
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace